app/views/users/show.html.haml

SELECT "users".* FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."cook_id" WHERE "follows"."user_id" = ?  [["user_id", 4]]
---
        - if @user.has_image
          - @user.user_images.each do |p|

SELECT "food_items".* FROM "food_items" WHERE "food_items"."user_id" = ?  [["user_id", 1]]
---
  #tabs-2
    - @user.food_items.each do |food|

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
        %tbody
          - if not @user.orders_as_customer.nil?

SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = ?  [["seller_id", 1]]
---
                %td= link_to "Write review", new_food_item_food_review_path(order.food_item_portion.food_item.id)
          - if not @user.orders_as_seller.nil?