app/views/food_items/edit.html.haml

          - counter = 0
          - @food_items.food_item_portions.each do |portion|
---
SELECT "food_item_portions".* FROM "food_item_portions" WHERE "food_item_portions"."food_item_id" = ?  [["food_item_id", 3]]