app/views/food_items/show.html.haml

      - if @current_user!=nil and @current_user.id == @food_item.user_id
        - @food_item.food_item_portions.each do |portion|
---
SELECT "food_item_portions".* FROM "food_item_portions" WHERE "food_item_portions"."food_item_id" = ?  [["food_item_id", 3]]