app/controllers/food_items_controller.rb

  def show
    @food_item = FoodItem.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT 1  [["id", 3]]

  def create
    user = User.find(session[:user_id])

    @food_item = user.food_items.build(:name => food_item_params[:name], :category => food_item_params[:category],
                  :description => food_item_params[:description])

    @food_item.transaction do

      if @food_item.save

        food_item_params[:portion].keys.each do |portionKey|
          @food_item_portion = @food_item.food_item_portions.build(:portion => food_item_params[:portion][portionKey],
                                :price => food_item_params[:price][portionKey])
          if not @food_item_portion.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "food_items" ("name", "category", "description", "user_id") VALUES (?, ?, ?, ?)  [["name", "testFood"], ["category", "testC"], ["description", "testD"], ["user_id", 1]]
INSERT INTO "food_item_portions" ("portion", "price", "food_item_id") VALUES (?, ?, ?)  [["portion", "XX"], ["price", 3.0], ["food_item_id", 3]]

  def edit
    @food_items = FoodItem.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @food_item = FoodItem.find(params[:id])
    @food_item.name = food_item_params[:name]
    @food_item.category = food_item_params[:category]
    @food_item.description = food_item_params[:description]

    @food_items = @food_item
    @food_item.transaction do

      if @food_item.save

        @food_item.food_item_portions.destroy_all
        food_item_params[:portion].keys.each do |portionKey|
          @food_item_portion = @food_item.food_item_portions.build(:portion => food_item_params[:portion][portionKey],
                                :price => food_item_params[:price][portionKey])
          if not @food_item_portion.save
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "food_item_portions" WHERE "food_item_portions"."id" = ?  [["id", 3]]
INSERT INTO "food_item_portions" ("portion", "price", "food_item_id") VALUES (?, ?, ?)  [["portion", "XX"], ["price", 3.0], ["food_item_id", 3]]