app/controllers/orders_controller.rb

SELECT "food_item_portions".* FROM "food_item_portions" WHERE "food_item_portions"."food_item_id" = ?  [["food_item_id", 3]]
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def order
    @food_item_portion = FoodItemPortion.find(order_params[:food_item_portion])
    @food_item = @food_item_portion.food_item
    @user = get_current_user
    if !@food_item.availability or !@user.availability
      flash[:notice] = "Sorry, this item is current unavailable"
      redirect_to root_path
      return
    end
    @order = @food_item_portion.orders.build(:customer_id => @user.id, :seller_id => @food_item.user.id, :price_per_portion => @food_item_portion.price, :quantity => order_params[:quantity], :status => "pending")