app/controllers/sessions_controller.rb

  def login
    user = User.find_by_email(session_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "avi.lucky.talreja@gmail.com"]]